Repository: DeuneB07/mezuri
Catalog: assets/l10n/app_*.arb
Languages: es

# mainLanguage
source: en
es: es

# homeViewLoadingText
source: Mezuri is preparing the application. Thanks for waiting
es: Mezuri está preparando la aplicación. Gracias por esperar

# navigationProfileLabel
source: Profile
es: Perfil

# navigationMeasuresLabel
source: Measures
es: Registros

# navigationStatsLabel
source: Stats
es: Estadísticas

# navigationMoreLabel
source: More
es: Otros

# welcomeLabel
source: Welcome,
es: Bienvenido,

# personalInformation
source: Your Information
es: Tu Información

# editProfileBtn
source: Edit
es: Editar

# birthdateLabel
source: Birthdate
es: Fecha de Nacimiento

# ageLabel
source: Age
es: Edad

# yearsLabel
source: years
es: años

# genderLabel
source: Gender
es: Género

# weightLabel
source: Weight
es: Peso

# heightLabel
source: Height
es: Altura

# medicinesLabel
source: Medicines
es: Medicinas

# medicinesDescription
source: Check here the different medicines you have added
es: Consulta aquí los medicamentos que has añadido

# suggestionsLabel
source: Suggestions
es: Sugerencias

# suggestionsDescription
source: Check here the different suggestions you have added
es: Consulta aquí las sugerencias que has añadido

# interestingLabel
source: Curious Fact
es: Dato Curioso

# usersOptionLabel
source: Users
es: Usuarios

# usersOptionDescription
source: Check the different users register in the app
es: Consulta el listado de usuarios registrados en la aplicación

# mapsOptionLabel
source: Maps
es: Mapas

# mapsOptionDescription
source: Find pharmacies and places of interest near your position
es: Busca farmacias y lugares de interés cerca de tu posición

# foodOptionLabel
source: Nutrition
es: Nutrición

# foodOptionDescription
source: Check how healthy is the food you eat daily
es: Consulta cómo de sana es la comida que te llevas a la boca

# notificationsOptionLabel
source: Alerts
es: Notificaciones

# notificationsOptionDescription
source: Control your measurements by activating reminders
es: Controla tus mediciones activando recordatorios

# settingsOptionLabel
source: Settings
es: Configuración

# settingsOptionDescription
source: Modify some aspects of the application or take the data to another site
es: Modifica algunos aspectos de la aplicación o llévate los datos a otro sitio

# genderMale
source: Male
es: Hombre

# genderFemale
source: Female
es: Mujer

# genderOther
source: Other
es: Otro

# diabetesTypeOne
source: Type 1
es: Tipo 1

# diabetesTypeTwo
source: Type 2
es: Tipo 2

# diabetesTypeGestational
source: Gestational
es: Gestacional

# exerciseIntensityAny
source: Nothing
es: Ninguna

# exerciseIntensityLow
source: Low
es: Baja

# exerciseIntensityMedium
source: Medium
es: Media

# exerciseIntensityHigh
source: High
es: Alta

# exerciseIntensityUndefined
source: Undefined
es: Sin definir

# foodTimeNoEating
source: Empty Stomach
es: En Ayunas

# foodTimeBeforeEating
source: Before Eating
es: Antes de Comer

# foodTimeAfterEating
source: After Eating
es: Después de Comer

# mealTypeBreakfast
source: Breakfast
es: Desayuno

# mealTypeLunch
source: Lunch
es: Comida

# mealTypeDinner
source: Dinner
es: Cena

# mealTypeSnack
source: Snack
es: Aperitivo

# symptomsHighThirst
source: Increased Thirst
es: Aumento de Sed

# symptomsHighPee
source: Frequent Urination
es: Micción Frecuente

# symptomsHighFatigue
source: Fatigue
es: Fatiga

# symptomsHighSickness
source: Sickness
es: Náuseas

# symptomsHighBreathDifficulty
source: Difficulty Breathing
es: Dificultad para Respirar

# symptomsHighBadBreath
source: Bad Breath
es: Mal Aliento

# symptomsHighStomachAche
source: Stomach Ache
es: Dolor de Estómago

# symptomsHighDryMouth
source: Dry Mouth
es: Sequedad en la Boca

# symptomsHighFastBpm
source: Accelerated Pulse
es: Pulsaciones Aceleradas

# symptomsLowTremors
source: Tremors
es: Temblores

# symptomsLowNervousness
source: Nervousness
es: Nerviosismo

# symptomsLowIrritability
source: Irritability
es: Irritabilidad

# symptomsLowAnxiety
source: Anxiety
es: Ansiedad

# symptomsLowWeakness
source: Weakness
es: Debilidad

# symptomsLowSweating
source: Sweating
es: Sudoración

# symptomsLowHunger
source: Hunger
es: Hambre

# symptomsLowBrainFog
source: Brain Fog
es: Niebla Cerebral

# symptomsLowDizziness
source: Dizziness
es: Mareo

# symptomsLowSpeakDifficulty
source: Difficulty Speaking
es: Dificultad para Hablar

# symptomsLowDisorientation
source: Disorientation
es: Desorientación

# mandatoryData
source: Mandatory Information
es: Datos Obligatorios

# mandatoryDataDescription
source: This information is useful to create your profile. Fill the fields and continue your travel in Mezuri.
es: Necesitamos esta información para tu perfil. Rellénalos y continúa tu viaje en Mezuri.

# usernameHeader
source: Username
es: Nombre de Usuario

# diabetesTypeHeader
source: Diabetes Type
es: Tipo de Diabetes

# chooseDiabetesHeader
source: Choose your diabetes type
es: Indique su diabetes

# changeProfileIconLabel
source: Change Image
es: Cambiar Imagen

# optionalData
source: Optional Information
es: Datos Opcionales

# optionalDataDescription
source: This fields are not mandatory, so fill the information only if you feel good with them.
es: Estos datos no son obligatorios, así que rellénalos sólo si te encuentras cómodo con ellos.

# disabledData
source: Keep this field without use
es: No usar este dato

# updateUsrSuccessHeader
source: Everything ready!
es: ¡Todo listo!

# updateUsrLoadingHeader
source: Updating user...
es: Actualizando...

# updateUsrErrorHeader
source: An error occurred while updating
es: Un error salvaje apareció

# medicinesScreenDescription
source: Add the medicines you want and tap the lower button to modify them!
es: Añade las medicinas que quieras y toca el botón inferior para añadirlas

# medicinesFormLabel
source: Medicine
es: Medicina

# medicinesNumberList
source: Medicines added:
es: Número de medicinas en la lista:

# suggestionLessThan
source: This suggestion will show when your glucose level is less than
es: Esta sugerencia se mostrará cuando tu glucosa sea menor a

# suggestionMoreThan
source: This suggestion will show when your glucose level is more than
es: Esta sugerencia se mostrará cuando tu glucosa sea mayor a

# suggestionMediumThan
source: This suggestion will show when your glucose level is between
es: Esta sugerencia se mostrará cuando tu glucosa se encuentre entre

# addedHeader
source: Added
es: Añadidas

# suggestionMinLevel
source: Low Limit
es: Nivel Mínimo

# suggestionMaxLevel
source: High Limit
es: Nivel Máximo

# suggestionMedicinesAdded
source: Medicines added to this suggestion
es: Medicinas añadidas a esta sugerencia

# suggestionModifyMedicines
source: Modify Added Medicines
es: Modificar Medicinas

# suggestionErrorNoBothEmpty
source: Cannot be left unused both values
es: No pueden dejarse sin usar ambos valores

# suggestionErrorEqualValues
source: Low limit cannot be higher or equal than high limit
es: El valor mínimo no puede superar o igualar al valor máximo

# errorLeastOneMedicine
source: Necessary to add at least one medicine
es: Debes tener añadida al menos una medicina

# msrFormHeader
source: How do you feel today,
es: ¿Qué tal te encuentras hoy,

# msrFormDate
source: Date
es: Fecha

# msrFormTime
source: Hour
es: Hora

# msrFormFoodTimeHeader
source: State
es: Estado

# msrFormMealTypeHeader
source: Meal Type
es: Tipo de Comida

# msrFormMealTypeDescription
source: What food have you or are you going to make?
es: ¿Qué comida has realizado o vas a realizar?

# msrFormGlucoseLevel
source: Glucose Level
es: Nivel de Glucosa

# msrFormFoodTimeDescription
source: At what point did you take this medicine?
es: ¿En qué momento has tomado esta medicina?

# msrFormSymptomsDescription
source: Have you been suffering any symptom? Select it and note here for ask later with your doctor
es: ¿Has sufrido algún síntoma? Seleccionalo y déjalo apuntado para consultarlo después con tu médico.

# msrFormOptionalDataHeader
source: Before you go...
es: Antes de Irte...

# msrFormOptionalExerciseHeader
source: Exercise Performed
es: Ejercicio Realizado

# msrFormOptionalExerciseDescription
source: How long have you been exercising?
es: ¿Qué cantidad de ejercicio has realizado hasta esta medición?

# msrFormOptionalDataDescription
source: Anything more to add? Tell us something!
es: ¿Quieres añadir algo más? Qué vida has llevado desde la anterior medición, ejercicio realizado... ¡Cuéntanos algo!

# msrFormOptionalQuitExercise
source: Quit exercise
es: No añadir ejercicio

# msrFormOptionalNoteDescription
source: If you want to add something else, this is your place
es: Si quieres añadir alguna información a esta medición, puedes hacerlo desde aquí

# msrDetailsViewSome
source: Anything to see?
es: ¿Qué quieres ver?

# msrDetailsMedsTaken
source: Taken Medicines
es: Medicinas Tomadas

# msrDetailsSuggestions
source: Specific Suggestions
es: Sugerencias Específicas

# msrSymptomsDetected
source: Symptoms Detected:
es: Síntomas Detectados:

# msrDetailsHeader
source: Details
es: Detalles

# msrDetailsSomethingMore
source: Something More?
es: ¿Algo más?

# msrDetailsNoDescription
source: There is no description about this measure
es: No hay una descripción sobre esta medición

# msrDetailsExerciseHeader
source: Physical Activity
es: Actividad Física

# msrDetailsNoExercise
source: There is no exercise about this measure
es: No se ha indicado ninguna actividad

# msrDetailsExerciseDuration
source: Duration
es: Duración

# msrDetailsSymptomsDetected
source: Symptoms Detected
es: Síntomas Detectados

# msrDetailsEmptySymptoms
source: Any symptom in this measure... Great!
es: No hay síntomas en esta medida... ¡Genial!

# symptomsGlucoseLevel
source: Usually
es: Normalmente con

# symptomsGlucoseLabel
source: glucose
es: glucosa

# symptomAlreadyAdded
source: This symptom has been already added
es: Este síntoma ya está añadido

# symptomHighGlucose
source: high
es: alto

# symptomLowGlucose
source: low
es: bajo

# chartOneTime
source: time
es: vez

# chartVariousTimes
source: times
es: veces

# chartsNoData
source: There is no data to draw this charts. Add some measure to solve it!
es: No hay datos para elaborar estos diagramas. Añade alguna medición para empezar.

# ntfAddEditDescription
source: Set when and what will show the notification programmed.
es: Establece cuándo y qué deseas que mostremos para esta notificación.

# ntfDescriptionLabel
source: Description
es: Descripción

# ntfDescriptionScreen
source: Set the different notifications to remember your measures when you need it
es: Configura las notificaciones de la aplicación para que te recuerden tus mediciones cada día.

# ntfDeleteAdviseDescription
source: This notification will not show anymore from now if you delete it
es: Se borrará esta notificación y no volverá a mostrar más a partir de ahora

# ntfEmptyTitle
source: It's dangerous to go alone
es: Es peligroso ir sólo

# ntfEmptyDescription
source: This is a reminder. Maybe it's time to note another measure.
es: Esto es un recordatorio. Quizás sea momento de tomar otra medición...

# calendarHelpText
source: Choose a date
es: Selecciona una Fecha

# calendarFieldLabel
source: Introduce a date
es: Introduzca una Fecha

# calendarFieldHint
source: dd/mm/yyyy
es: dd/mm/aaaa

# msrMedicinesDialog
source: Quantity
es: Cantidad

# msrMedicinesHeader
source: Full Listing
es: Listado Completo

# msrMedicinesDescription
source: Choose the medicines taken in this measure to keep a registry of them. Each medicine must have a quantity associated.
es: Selecciona las medicinas que hayas tomado para tener un registro de ellas. Cada medicina debe tener una cantidad asociada a ella.

# msrErrorCancelEdition
source: It's necessary to cancel the edition
es: Es necesario cancelar la edición

# medicinesErrorAddNoSelect
source: What do you intend to do?
es: ¿Qué tramas, moreno?

# medicinesErrorAlreadyAdded
source: This medicine is already added
es: Esta medicina ya ha sido añadida

# medicinesSelectionDescription
source: Choose the medicines includes in this suggestion. Each medicine must have a quantity associated.
es: Selecciona las medicinas que quieres y añádelas a esta sugerencia. Cada medicina tendrá su cantidad asociada a ella.

# registryAppbarLabel
source: Registry
es: Mediciones

# deleteAdviseHeader
source: Are you sure?
es: ¿Estás seguro?

# measureDeleteAdviseBody
source: A measure is something important... Think about if you want to delete it
es: Una medición no es algo que subestimar... Piensa bien si quieres eliminarla

# medicineSuggestionDeleteAdviseBody
source: This will delete the medicine from the current suggestion
es: Esto eliminará la medicina de la actual sugerencia.

# medicinesDeleteAdviseBody
source: You're going to delete a medicine. This will be erased from all the sites where it is (e.g. suggestions, measures...).
es: Vas a eliminar una medicina. Esta se borrará de todos los sitios donde la tengas añadida (sugerencias, mediciones...).

# msrSuggestionDialogHeader
source: Suggestions
es: Recomendaciones

# msrSuggestionDialogDescription
source: According glucose level, the reference suggestions found are:
es: De acuerdo al nivel de glucosa, las sugerencias de referencia encontradas son:

# suggestionMono
source: Suggestion
es: Sugerencia

# suggestionQuantityUnit
source: units
es: unidades

# suggestionMedsAddedLowCase
source: medicines added
es: medicinas añadidas

# suggestionDetailsDescription
source: This suggestion will appear when the measure level was between defined levels.
es: Esta sugerencia se activará cuando tu medición se adecúe a los niveles entre los que está definida.

# suggestionDetailsMedsAddedHeader
source: Medicines Added
es: Medicinas Añadidas

# suggestionDeleteAdviseBody
source: Delete this suggestion implies delete from recommended suggestions in measures.
es: Eliminar esta sugerencia hará que no esté disponible al tomarte una medición.

# suggestionDescriptionListing
source: These suggestions are those which have been added. Tap one of them to see in details or modify it.
es: Estas sugerencias son las que has añadido. Toca una de ellas para verla en detalle o modificarla.

# userListDescription
source: These are the registered users. Tap one to swap main user to that or delete it if not is necessary anymore.
es: Estos son los usuarios registrados. Accede a sus datos cambiando a ellos o elimínalos si no te son necesarios.

# userDeleteAdviseBody
source: You're going to delete an user... All the information will be deleted and cannot be recover.
es: Estás a punto de eliminar a un usuario. Toda su información será eliminada y no se recuperará.

# nutritionSearchLabel
source: Search
es: Búsqueda

# nutritionErrorMsg
source: An error occurred. Check your internet connection and try again
es: Se ha producido un error. Revisa tu conexión a internet y vuelve a intentarlo

# nutritionLoadingMsg
source: Searching information... Please, wait a few seconds.
es: Estamos buscando información de estos alimentos. Esto podría tardar unos segundos.

# nutritionNoResultsMsgOne
source: Any result with the parameters
es: Ningún resultado con la búsqueda

# nutritionNoResultsMsgTwo
source: Try with other
es: Inténtalo con otra.

# nutritionPrimaryMsg
source: Search to find different foods and check important nutritional information about them
es: Busca diferentes alimentos y consulte la información nutricional de cada uno desde aquí

# nutritionInformationTabLabel
source: Information
es: Información

# nutritionNutritionalTabLabel
source: Nutritional Value
es: Valor Nutricional

# nutritionAllergensLabel
source: Allergens
es: Alérgenos

# nutritionAllergensContainsMsg
source: This product could contain:
es: Este producto puede contener:

# nutritionAllergensEmptyMsg
source: No allergens have been recorded for this product.
es: No se ha registrado ningún alérgeno para este producto.

# nutritionTracesLabel
source: Traces
es: Trazas

# nutritionTracesContainsMsg
source: May contain traces of:
es: Puede contener trazas de:

# nutritionTracesEmptyMsg
source: This product has not been recorded to contain traces of any kind.
es: No se ha registrado que este producto contenga trazas de ningún tipo.

# nutritionCategoriesLabel
source: Categories:
es: Categorías:

# nutritionEcoScoreHeader
source: Ecological Impact
es: Valoración Ecológica

# nutritionEcoScoreKnownOne
source: To be manufactured and packaged, the impact of this product is a
es: Para ser fabricado y envasado, el impacto de este producto es una

# nutritionEcoScoreKnownTwo
source: , equivalent to
es: , equivalente a un

# nutritionEcoScoreKnownThree
source: over 100
es: sobre 100

# nutritionEcoScoreUnknown
source: The ecological impact of this product is not known.
es: No se conoce el impacto ecológico de este producto.

# nutritionPackaging
source: Packaging Weight:
es: Peso del Producto:

# nutritionBarcode
source: Barcode:
es: Código de Barras:

# nutritionIngredientsLabel
source: Ingredients
es: Ingredientes

# nutritionIngredientsEmptyMsg
source: No ingredient in this product has been registered.
es: No se ha registrado ningún ingrediente de este producto.

# nutritionNutriscoreHeader
source: Nutritional Value
es: Valoración Alimenticia

# nutritionNutriscoreKnown
source: On a food scale from A to D, where A is the best possible value, this product achieves the valuation:
es: En una escala alimenticia de la A a la D, donde la A es el mejor valor posible, este producto alcanza la valoración:

# nutritionNutriscoreUnknown
source: The nutritional value of this product is not known.
es: No se conoce el valor nutricional de este producto.

# nutritionNutrimentsHeader
source: Nutrient Levels
es: Niveles de Nutrientes

# nutritionQuestionsRelated
source: Related Questions
es: Preguntas Relacionadas

# nutritionQuestionsPalmOil
source: Does it contain palm oil?
es: ¿Contiene aceite de palma?

# nutritionQuestionsIsVegetarian
source: Is vegetarian?
es: ¿Es vegetariano?

# nutritionQuestionsIsVegan
source: Is vegan?
es: ¿Es vegano?

# emptyListPhraseOne
source: This list is a a baby yet. Add some medicines and make it grow
es: Esta lista aún está en pañales. Añade alguna medicina y hazla crecer

# emptyListPhraseTwo
source: Anything added yet? Mezuri is sad...
es: ¿Aún no has añadido ninguna? Mezuri está triste...

source: Less than
es: Menor a

source: More than
es: Mayor a

# nutrientLevelHigh
source: High
es: Alto

# nutrientLevelLow
source: Low
es: Bajo

# nutrientLevelModerate
source: Moderate
es: Medio

source: Yes
es: Sí

# glucoseWarningLabelGood
source: Perfect!
es: ¡Perfecto!

# glucoseWarningLabelCaution
source: Be Careful...
es: Cuidado...

# glucoseWarningLabelDanger
source: Danger
es: Peligro

# chartTimeId
source: Time
es: Tiempo

# chartTimeHeader
source: Measures
es: Mediciones

# chartTimeDescription
source: At what point have you made your last measurements?
es: ¿En qué momento has realizado tus últimas mediciones?

# chartGlucoseId
source: Glucose
es: Glucosa

# chartGlucoseHeader
source: Glucose State
es: Estado de Glucosa

# chartGlucoseDescription
source: Have levels been good during the last months?
es: ¿Se han mantenido unos niveles adecuados?

source: Between
es: Entre

source: and
es: y

# undefinedLabel
source: Undefined
es: Sin definir

# cancelButton
source: Cancel
es: Cancelar

# confirmButton
source: Confirm
es: Confirmar

# previousButton
source: Previous
es: Anterior

# nextButton
source: Next
es: Siguiente

# finalizeButton
source: End
es: Finalizar

# closeButton
source: Close
es: Cerrar

# retryButton
source: Retry
es: Reintentar

# continueButton
source: Continue
es: Avanzar

# addButton
source: Add
es: Añadir

# deleteButton
source: Remove
es: Eliminar

# errorNoEmptyValue
source: This value cannon be empty
es: Este valor debe rellenarse

# errorCharactersLimit
source: Characters limitation overpassed
es: Superado el límite de carácteres

# errorInvalidText
source: This text is not accepted
es: Este texto no es válido

# errorInvalidFormat
source: This format is not accepted
es: Este formato no es válido

# errorNoFutureMeasures
source: No future measurements
es: Nada de mediciones futuras

# errorMandatoryIntensity
source: It's necessary to choose an intensity to add an exercise
es: Debe seleccionarse una intensidad para añadirse

# errorMandatoryMedicine
source: Must select a medicine to add it
es: Debe seleccionarse una medicina para poder añadirse

# errorOnlyNumbers
source: Only numbers are accepted
es: Sólo se aceptan números
